tutorials/2D/simpleDarcyFoam/0/K
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volTensorField;
    location    "0";
    object      K;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 0 0 0 0 0];

internalField   nonuniform List<tensor> 
20000
(
(0.000196102 0 0 0 0.000196102 0 0 0 0.000196102)
(0.000190475 0 0 0 0.000190475 0 0 0 0.000190475)
(0.00018538 0 0 0 0.00018538 0 0 0 0.00018538)
(0.00018096 0 0 0 0.00018096 0 0 0 0.00018096)
(0.000177283 0 0 0 0.000177283 0 0 0 0.000177283)
(0.000174331 0 0 0 0.000174331 0 0 0 0.000174331)
(0.00017201 0 0 0 0.00017201 0 0 0 0.00017201)
(0.000170151 0 0 0 0.000170151 0 0 0 0.000170151)
...
)
;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    upperWall
    {
        type            cyclic;
    }
    lowerWall
    {
        type            cyclic;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
